; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph5 - mode
	infrared3 - mode
	image0 - mode
	infrared4 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation2 - direction
	GroundStation8 - direction
	Star7 - direction
	Star9 - direction
	Star3 - direction
	Star0 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star6 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star7)
	(supports instrument3 thermograph5)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph2)
	(supports instrument5 image0)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph5)
	(supports instrument6 image0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star3)
	(supports instrument7 infrared3)
	(supports instrument7 infrared4)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 thermograph2)
	(supports instrument8 image0)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Planet10 thermograph2)
	(have_image Phenomenon11 infrared1)
	(have_image Phenomenon11 thermograph5)
	(have_image Star12 thermograph5)
	(have_image Star12 image0)
	(have_image Phenomenon13 infrared4)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 image0)
))

)

; plan
1. (turn_to satellite3 star0 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star0)
   goals met: 0 of 9
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite3 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite3 phenomenon11 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon11)
   goals met: 0 of 9
5. (turn_to satellite2 star3 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star3)
   goals met: 0 of 9
6. (turn_to satellite1 star7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star7)
   goals met: 0 of 9
7. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   goals met: 0 of 9
8. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 9
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
11. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 9
12. (calibrate satellite1 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 0 of 9
13. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 9
14. (take_image satellite3 phenomenon11 instrument6 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 1 of 9
15. (turn_to satellite0 phenomenon13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 9
16. (take_image satellite0 phenomenon13 instrument0 infrared4)
   added: (have_image phenomenon13 infrared4)
   goals met: 2 of 9
17. (turn_to satellite0 star3 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star3)
   goals met: 3 of 9
18. (turn_to satellite1 phenomenon11 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 9
19. (take_image satellite1 phenomenon11 instrument2 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 4 of 9
20. (turn_to satellite1 phenomenon13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 9
21. (take_image satellite1 phenomenon13 instrument2 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 5 of 9
22. (turn_to satellite2 planet10 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet10)
   goals met: 5 of 9
23. (take_image satellite2 planet10 instrument5 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 6 of 9
24. (turn_to satellite2 star14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star14)
   goals met: 6 of 9
25. (take_image satellite2 star14 instrument5 image0)
   added: (have_image star14 image0)
   goals met: 7 of 9
26. (turn_to satellite3 star12 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star12)
   goals met: 7 of 9
27. (take_image satellite3 star12 instrument6 image0)
   added: (have_image star12 image0)
   goals met: 8 of 9
28. (take_image satellite3 star12 instrument6 thermograph5)
   added: (have_image star12 thermograph5)
   goals met: 9 of 9
